const express = require('express');
const app = express();
const cors = require('cors');

const rolls = [
   {
      id: 1,
      name: 'Калифорния',
      img: '/img/роллы/1.png',
      weight: '200г',
      ingredients: ['Рис', 'Краб', 'Авокадо', 'Икра'],
      price: 500,
      much: '8',
      legend: 'Сказано в древних свитках, что дракон, парящий над океаном, однажды обратился в сверкающий ролл, чтобы даровать свою мудрость тем, кто его вкусит.'
   },
   {
      id: 2,
      name: 'Филадельфия',
      img: '/img/роллы/2.png',
      weight: '220г',
      ingredients: ['Рис', 'Лосось', 'Сыр Филадельфия', 'Огурец'],
      price: 550,
      much: '8',
      legend: 'Легенда гласит, что этот ролл несёт в себе силу священной горы, чьи снега освежают душу, а жар подземного вулкана согревает сердце.'
   },
   {
      id: 3,
      name: 'Унаги',
      img: '/img/роллы/3.png',
      weight: '210г',
      ingredients: ['Рис', 'Угорь', 'Авокадо', 'Соус Унаги'],
      price: 600,
      much: '8',
      legend: 'Как нежные лепестки сакуры, этот ролл раскрывает гармонию природы, заключённую в каждом кусочке, принося мир и спокойствие.'
   },
   {
      id: 4,
      name: 'Сяке маки',
      img: '/img/роллы/4.png',
      weight: '180г',
      ingredients: ['Рис', 'Лосось'],
      price: 400,
      much: '8',
      legend: 'В древности считалось, что тот, кто поймает эту рыбку, получит три желания, а её нежный вкус исполнит ваши гастрономические мечты.'
   },
   {
      id: 5,
      name: 'Спайси тунец',
      img: '/img/роллы/5.png',
      weight: '190г',
      ingredients: ['Рис', 'Тунец', 'Соус Спайси', 'Огурец'],
      price: 550,
      much: '8',
      legend: "Как огненная лиса Кицунэ, этот ролл манит своим острым, пленительным вкусом, пробуждая скрытую силу в каждом, кто осмелится попробовать."
   },
   {
      id: 6,
      name: 'Темпура ролл',
      img: '/img/роллы/6.png',
      weight: '230г',
      ingredients: ['Рис', 'Креветка', 'Темпура', 'Огурец'],
      price: 650,
      much: '8',
      legend: "Воплощение изобилия и гармонии, этот ролл, как сказочная гора Фудзи, оберегает тайны древних лесов и изобилие полей."
   },
   {
      id: 7,
      name: 'Дракон',
      img: '/img/роллы/7.png',
      weight: '250г',
      ingredients: ['Рис', 'Угорь', 'Авокадо', 'Огурец'],
      price: 700,
      much: '8',
      legend: "Сила могучего дракона Рюдзин заключена в этом ролле, его хрустящие чешуи и насыщенный вкус даруют благословение мудрости и богатства."
   },
   {
      id: 8,
      name: 'Осака ролл',
      img: '/img/роллы/8.png',
      weight: '240г',
      ingredients: ['Рис', 'Лосось', 'Сыр Крем', 'Икра Тобико'],
      price: 650,
      much: '8',
      legend: "Как легкое касание весеннего ветра, этот ролл пленяет хрустом обжаренной темпуры, пробуждая в душе воспоминания о цветущей сакуре."
   },
   {
      id: 9,
      name: 'Кунсей ролл',
      img: '/img/роллы/9.png',
      weight: '220г',
      ingredients: ['Рис', 'Копченый лосось', 'Авокадо', 'Сыр Филадельфия'],
      price: 600,
      much: '8',
      legend: "Этот ролл олицетворяет танец подводных духов, объединяя в себе нежность креветок и таинственность морских глубин."
   },
   {
      id: 10,
      name: 'Тай ролл',
      img: '/img/роллы/10.png',
      weight: '210г',
      ingredients: ['Рис', 'Креветка', 'Манго', 'Сыр Крем'],
      price: 600,
      much: '8',
      legend: "Вкус этого ролла словно тропа, ведущая через горы к первозданному озеру, где прячутся духи, дарующие рыбакам удачу и силу."
   },
   {
      id: 11,
      name: 'Сяке кунсей',
      img: '/img/роллы/11.png',
      weight: '200г',
      ingredients: ['Рис', 'Копченый лосось', 'Огурец', 'Авокадо'],
      price: 550,
      much: '8',
      legend: "Как жемчужины, украшающие шлемы самураев, икринки в этом ролле сверкают, обещая богатство и отвагу тому, кто разделит с ними трапезу."
   },
   {
      id: 12,
      name: 'Сакура ролл',
      img: '/img/роллы/12.png',
      weight: '220г',
      ingredients: ['Рис', 'Креветка', 'Авокадо', 'Сыр Крем'],
      price: 600,
      much: '8',
      legend: "Этот ролл хранит тепло домашнего очага, как сказочный феникс, возвращающийся к жизни после каждого укуса, наполняя сердце светом."


   },
   {
      id: 13,
      name: 'Токио ролл',
      img: '/img/роллы/13.png',
      weight: '240г',
      ingredients: ['Рис', 'Лосось', 'Авокадо', 'Икра Тобико'],
      price: 650,
      much: '8',
      legend: "Как леса Ёкай, этот ролл уводит вас в мир зелени и свежести, даруя силу природы и загадочный шепот листьев."
   },
   {
      id: 14,
      name: 'Темпура сяке',
      img: '/img/роллы/14.png',
      weight: '230г',
      ingredients: ['Рис', 'Лосось', 'Темпура', 'Соус Спайси'],
      price: 650,
      much: '8',
      legend: "Этот ролл — словно ледяное дыхание горного духа, который бережно хранит тайны дикой природы в своем холодном, но манящем объятии."
   },
   {
      id: 15,
      name: 'Сяське масяське',
      img: '/img/роллы/15.png',
      weight: '210г',
      ingredients: ['Рис', 'Авокадо', 'Огурец', 'Манго'],
      price: 450,
      much: '8',
      legend: "В сердце этого ролла горит пламя древних вулканов, чья сила пробуждается с каждым острым кусочком, даруя силу и страсть."
   },
   {
      id: 16,
      name: 'Аляска ролл',
      img: '/img/роллы/16.png',
      weight: '220г',
      ingredients: ['Рис', 'Лосось', 'Авокадо', 'Сыр Филадельфия'],
      price: 600,
      much: '8',
      legend: "Этот ролл — как изысканный веер гейши, раскрывающий тайны древних императорских садов с каждым изысканным слоем вкуса."
   },
   {
      id: 17,
      name: 'Спайси лосось',
      img: '/img/роллы/17.png',
      weight: '190г',
      ingredients: ['Рис', 'Лосось', 'Соус Спайси', 'Огурец'],
      price: 550,
      much: '8',
      legend: "Окутанный жаром, как кузнец, выковывающий легендарный меч, этот ролл заключает в себе огненную силу и непоколебимую волю."
   },
   {
      id: 18,
      name: 'Суши Сет 1',
      img: '/img/роллы/сет1.png',
      weight: '350г',
      ingredients: ['Рис', 'Лосось', 'Тунец', 'Креветка'],
      price: 800,
      much: '18',
      legend: "Как могучий тигр, который плавно скользит по бамбуковым зарослям, этот ролл пленяет своей силой и грацией, пробуждая инстинкты в каждом укусе."
   },
   {
      id: 19,
      name: 'Суши Сет 2',
      img: '/img/роллы/сет2.png',
      weight: '420г',
      ingredients: ['Рис', 'Лосось', 'Креветка', 'Икра Тобико', 'Сыр Крем'],
      price: 850,
      much: '20',
      legend: "В нем течет кровь океана, как вены на теле великого кита, а его вкус — это песнь морей, дарующая ясность ума и силу духа."
   },
   {
      id: 20,
      name: 'Суши Сет 3',
      img: '/img/роллы/сет3.png',
      weight: '500г',
      ingredients: ['Рис', 'Тунец', 'Копченый лосось', 'Угорь', 'Авокадо'],
      price: 900,
      much: '25',
      legend: "Словно дым от древних костров шаманов, этот ролл раскрывает перед вами тайны далеких гор и безграничных небес, где духи хранят свою мудрость."
   },
   {
      id: 21,
      name: 'Мидори ролл',
      img: '/img/роллы/3.png',
      weight: 210,
      ingredients: ['Рис', 'Авокадо', 'Салат', 'Икра Тобико'],
      price: '550₽',
      much: '8',
      legend: "Как утренний свет над лесами, этот ролл приносит свежесть и пробуждает силы природы в каждом кусочке."
   },
   {
      id: 22,
      name: 'Вулкан ролл',
      img: '/img/роллы/16.png',
      weight: '230г',
      ingredients: ['Рис', 'Лосось', 'Соус Спайси', 'Темпура кляр'],
      price: 700,
      much: '8',
      legend: "Словно огненная лава, этот ролл взрывается вкусами, принося силу древнего вулкана в каждый укус."
   },
   {
      id: 23,
      name: 'Кайзен ролл',
      img: '/img/роллы/12.png',
      weight: '220г',
      ingredients: ['Рис', 'Тунец', 'Авокадо', 'Сливочный сыр'],
      price: 650,
      much: '8',
      legend: "Этот ролл несет в себе мудрость перемен, улучшая жизнь того, кто вкусит его."
   },
   {
      id: 24,
      name: 'Киото ролл',
      img: '/img/роллы/6.png',
      weight: '240г',
      ingredients: ['Рис', 'Угорь', 'Креветка', 'Соус Унаги'],
      price: 750,
      much: '8',
      legend: "Как древний храм Киото, этот ролл хранит в себе традиции и спокойствие, принося мир в каждый укус."
   },
   {
      id: 25,
      name: 'Мацури ролл',
      img: '/img/роллы/2.png',
      weight: '220г',
      ingredients: ['Рис', 'Лосось', 'Манго', 'Икра Тобико'],
      price: 600,
      much: '8',
      legend: "Вкус этого ролла напоминает фестиваль под звездным небом, где каждый ингредиент танцует в ритме веселья."
   },
   {
      id: 26,
      name: 'Хоккайдо ролл',
      img: '/img/роллы/13.png',
      weight: '250г',
      ingredients: ['Рис', 'Гребешок', 'Крем-сыр', 'Огурец'],
      price: 850,
      much: '8',
      legend: "Сила холодных морей Хоккайдо заключена в этом ролле, принося свежесть и чистоту северных вод."
   },
   {
      id: 27,
      name: 'Мисо ролл',
      img: '/img/роллы/14.png',
      weight: '210г',
      ingredients: ['Рис', 'Тофу', 'Мисо соус', 'Огурец'],
      price: 550,
      much: '8',
      legend: "Как чашка горячего мисо супа, этот ролл согревает и наполняет уютом, напоминая о домашнем очаге."
   },
   {
      id: 28,
      name: 'Сусуру ролл',
      img: '/img/роллы/15.png',
      weight: '230г',
      ingredients: ['Рис', 'Тигровая креветка', 'Икра лосося', 'Авокадо'],
      price: 800,
      much: '8',
      legend: "Этот ролл – как шепот моря, он привносит в жизнь тот, кто его попробует, спокойствие и мудрость океанских глубин."
   },
   {
      id: 29,
      name: 'Юзу ролл',
      img: '/img/роллы/16.png',
      weight: '220г',
      ingredients: ['Рис', 'Лосось', 'Юзу', 'Огурец'],
      price: 600,
      much: '8',
      legend: "Этот ролл, как утренний бриз, наполнен свежестью цитрусового юзу и бодрит дух."
   },
   {
      id: 30,
      name: 'Тенши ролл',
      img: '/img/роллы/17.png',
      weight: '240г',
      ingredients: ['Рис', 'Снежный краб', 'Крем-сыр', 'Икра Тобико'],
      price: 750,
      much: '8',
      legend: "Как крылья ангела, этот ролл обволакивает нежностью и приносит легкость и спокойствие."
   },
   {
      id: 31,
      name: 'Саке Спайси',
      img: '/img/роллы/18.png',
      weight: '220г',
      ingredients: ['Рис', 'Лосось', 'Спайси соус', 'Икра Тобико'],
      price: 650,
      much: '8',
      legend: "Этот ролл, наполненный огнем, разогревает, как первые лучи солнца над заснеженной горой."
   },
   {
      id: 32,
      name: 'Икура ролл',
      img: '/img/роллы/19.png',
      weight: '210г',
      ingredients: ['Рис', 'Икра лосося', 'Авокадо', 'Огурец'],
      price: 700,
      much: '8',
      legend: "В этом ролле заключена сила реки, что несет свою воду из глубин гор, каждая икринка дарует новое начало."
   },
   {
      id: 33,
      name: 'Наруто ролл',
      img: '/img/роллы/20.png',
      weight: '200г',
      ingredients: ['Рис', 'Осьминог', 'Кунжут', 'Соус Терияки'],
      price: 600,
      much: '8',
      legend: "Секреты морских вихрей скрыты в этом ролле, принося ему уникальную силу и свежесть."
   },
];
app.use(cors());
app.get('/api/rolls', (req, res) => {
   res.json(rolls);
});

const PORT = 1010;
app.listen(PORT, () => {
   console.log(`Server is running on port ${PORT}`);
});



